In this notebook I will use the [Chinook Database](https://github.com/lerocha/chinook-database) to answer a bunch of simple questions. First, let's
connect to the database.

In [18]:
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
cred = {"host": 'localhost', 'dbname': 'yukontaf', 'user': 'glebsokolov',
        'password': ''}
from sqlalchemy import create_engine

con = create_engine(
    f'postgresql://{cred["user"]}:{cred["password"]}@{cred["host"]}/{cred["dbname"]}'
)


def select(sql):
    return pd.read_sql(sql, con)

The scheme of the database looks like this ![this](https://previews.dropbox.com/p/thumb/ABgcFGgWyXLXx2VvCYJfBa9uEX7RRcgXKk2cWScIcTe4Y0qcAFlSoVVDBguIqI9Ar8fNiIl75haODx8KnaIXnSI8WP6JL-HjObr6_8z6NkaI6m54qgzXreDW1f98yQCpdh-xor27CS6KR1D7oggpmobFxkkl4i_f-9w9UfD49t4Y7KH8qyLf2V0NCKny-WyS9AwnoJtio3j31RHDj4oqKl3iAaG4BGMcHPkuuq9-jrMFahYZGgiGFD_85v1RJzhvvwoUrgZeAHGDIIMFnTmEv5OqtCXLnlP88rPzI3oDuKehyFcF0Zygkpjf8kOuyIMUs4I5PSU7AM7QFRO1s3rptk8A0kUHqtT0RoTEm_lK6a2obPTsSCKPT2st6rgFGI6sR8U/p.png):

- Which countries have the most invoices?

In [6]:
sql = '''SELECT DISTINCT "BillingCountry",
                count("InvoiceId") OVER (PARTITION BY "BillingCountry") AS cnt
FROM "Invoice"
ORDER BY cnt DESC'''
select(sql)

    BillingCountry  cnt
0              USA   91
1           Canada   56
2           Brazil   35
3           France   35
4          Germany   28
5   United Kingdom   21
6   Czech Republic   14
7         Portugal   14
8            India   13
9        Argentina    7
10       Australia    7
11         Austria    7
12         Belgium    7
13           Chile    7
14         Denmark    7
15         Finland    7
16         Hungary    7
17         Ireland    7
18           Italy    7
19     Netherlands    7
20          Norway    7
21          Poland    7
22           Spain    7
23          Sweden    7

- Which city has the best customers? (We need to find out which city has the highest
 sum of invoice totals)

In [7]:
sql = '''SELECT "BillingCity",
       sum("Total") AS total
FROM "Invoice"
GROUP BY "BillingCity"
ORDER BY total DESC
LIMIT 1'''
select(sql)

  BillingCity  total
0      Prague  90.24

- Who is the best customer? (Build a query that returns the person who has spent the
most money)

In [8]:
sql = '''SELECT DISTINCT "CustomerId" ,
                sum("Total") OVER (PARTITION BY "CustomerId") AS total_sum
FROM "Invoice" a
LEFT JOIN "InvoiceLine" b ON a."InvoiceId" = b."InvoiceId"
ORDER BY total_sum DESC'''
select(sql)

    CustomerId  total_sum
0            6     502.62
1           26     474.62
2           45     446.62
3           46     446.62
4           57     415.62
5           25     404.62
6            7     404.62
7           37     388.62
8           24     378.62
9           43     376.62
10           5     376.62
11          28     370.62
12           4     362.62
13          48     352.62
14          34     352.62
15          17     352.62
16          44     350.62
17          15     343.62
18          51     340.62
19          42     338.62
20          22     338.62
21           3     338.62
22          20     338.62
23           1     338.62
24          40     336.62
25          39     335.62
26          58     335.62
27          19     335.62
28          49     334.62
29          53     334.62
30          14     334.62
31          18     334.62
32          35     334.62
33          11     334.62
34          10     334.62
35          50     334.62
36          29     334.62
37          54     334.62
38          31     334.62
39          13     334.62
40          27     334.62
41          16     334.62
42          36     334.62
43          30     334.62
44          55     334.62
45          33     334.62
46          38     334.62
47          56     334.62
48           2     334.62
49          21     334.62
50          47     334.62
51          32     334.62
52          12     334.62
53          41     334.62
54           9     334.62
55           8     334.62
56          52     334.62
57          23     334.62
58          59     331.66

- Find out the email, first name, last name, and Genre of all Rock Music listeners

In [13]:
sql = '''SELECT "FirstName",
       "LastName",
       "Email",
       e."Name"
FROM "Invoice" a
         LEFT JOIN "InvoiceLine" b ON a."InvoiceId" = b."InvoiceId"
         LEFT JOIN "Customer" c ON a."CustomerId" = c."CustomerId"
         LEFT JOIN "Track" d ON b."TrackId" = d."TrackId"
         LEFT JOIN "Genre" e ON d."GenreId" = e."GenreId"'''
select(sql)

    FirstName      LastName                          Email  Name
0       Aaron      Mitchell         aaronmitchell@yahoo.ca  Rock
1   Alexandre         Rocha               alero@uol.com.br  Rock
2      Astrid        Gruber         astrid.gruber@apple.at  Rock
3       Bj�rn        Hansen          bjorn.hansen@yahoo.no  Rock
4     Camille       Bernard       camille.bernard@yahoo.fr  Rock
5        Daan       Peeters          daan_peeters@apple.be  Rock
6       Diego     Guti�rrez       diego.gutierrez@yahoo.ar  Rock
7         Dan        Miller            dmiller@comcast.com  Rock
8   Dominique      Lefebvre    dominiquelefebvre@gmail.com  Rock
9      Edward       Francis            edfrancis@yachoo.ca  Rock
10    Eduardo       Martins       eduardo@woodstock.com.br  Rock
11      Ellie      Sullivan         ellie.sullivan@shaw.ca  Rock
12       Emma         Jones         emma_jones@hotmail.com  Rock
13    Enrique         Mu�oz         enrique_munoz@yahoo.es  Rock
14   Fernanda         Ramos       fernadaramos4@uol.com.br  Rock
15      Frank        Harris             fharris@google.com  Rock
16      Frank       Ralston             fralston@gmail.com  Rock
17  Franti�ek   Wichterlov�       frantisekw@jetbrains.com  Rock
18   Fran�ois      Tremblay            ftremblay@gmail.com  Rock
19       Fynn    Zimmermann           fzimmermann@yahoo.de  Rock
20     Hannah     Schneider      hannah.schneider@yahoo.de  Rock
21     Helena          Hol�                hholy@gmail.com  Rock
22    Heather       Leacock             hleacock@gmail.com  Rock
23       Hugh      O'Reilly           hughoreilly@apple.ie  Rock
24   Isabelle       Mercier      isabelle_mercier@apple.fr  Rock
25       Jack         Smith        jacksmith@microsoft.com  Rock
26   Jennifer      Peterson            jenniferp@rogers.ca  Rock
27       Jo�o     Fernandes            jfernandes@yahoo.pt  Rock
28     Joakim     Johansson      joakim.johansson@yahoo.se  Rock
29   Johannes  Van der Berg        johavanderberg@yahoo.nl  Rock
30       John        Gordon         johngordon22@yahoo.com  Rock
31      Julia       Barnett            jubarnett@gmail.com  Rock
32      Kathy         Chase            kachase@hotmail.com  Rock
33       Kara       Nielsen          kara.nielsen@jubii.dk  Rock
34   Ladislav        Kov�cs       ladislav_kovacs@apple.hu  Rock
35     Leonie        K�hler          leonekohler@surfeu.de  Rock
36      Lucas       Mancini         lucas.mancini@yahoo.it  Rock
37       Lu�s     Gon�alves           luisg@embraer.com.br  Rock
38       Luis         Rojas             luisrojas@yahoo.cl  Rock
39      Manoj        Pareek        manoj.pareek@rediff.com  Rock
40       Marc        Dubois        marc.dubois@hotmail.com  Rock
41       Mark        Taylor           mark.taylor@yahoo.au  Rock
42     Martha          Silk           marthasilk@gmail.com  Rock
43   Madalena       Sampaio              masampaio@sapo.pt  Rock
44   Michelle        Brooks              michelleb@aol.com  Rock
45       Mark       Philips             mphilips12@shaw.ca  Rock
46     Niklas      Schr�der            nschroder@surfeu.de  Rock
47    Patrick          Gray           patrick.gray@aol.com  Rock
48       Phil        Hughes          phil.hughes@gmail.com  Rock
49       Puja    Srivastava       puja_srivastava@yahoo.in  Rock
50    Richard    Cunningham       ricunningham@hotmail.com  Rock
51     Robert         Brown               robbrown@shaw.ca  Rock
52    Roberto       Almeida  roberto.almeida@riotur.gov.br  Rock
53  Stanislaw        W�jcik         stanislaw.w�jcik@wp.pl  Rock
54      Steve        Murray          steve.murray@yahoo.uk  Rock
55      Terhi    H�m�l�inen      terhi.hamalainen@apple.fi  Rock
56        Tim         Goyer               tgoyer@apple.com  Rock
57     Victor       Stevens             vstevens@yahoo.com  Rock
58      Wyatt        Girard          wyatt.girard@yahoo.fr  Rock

- Now let's find  the artists who have written the most rock music in our dataset.
So, I will write a query that returns the Artist name and total track count of the top
 10 rock bands.

In [15]:
sql = '''SELECT DISTINCT a."Name",
                count(c."Name") OVER (PARTITION BY a."Name") AS song_cnt
FROM "Artist" a
         LEFT JOIN "Album" b ON a."ArtistId" = b."ArtistId"
         LEFT JOIN "Track" c ON b."AlbumId" = c."AlbumId"
         LEFT JOIN "Genre" d ON c."GenreId" = d."GenreId"
WHERE d."Name" = 'Rock'
ORDER BY song_cnt DESC'''
select(sql)

                                        Name  ArtistId  song_cnt
0                               Led Zeppelin        22       114
1                                         U2       150       112
2                                Deep Purple        58        92
3                                Iron Maiden        90        81
4                                  Pearl Jam       118        54
5                                  Van Halen       152        52
6                                      Queen        51        45
7                         The Rolling Stones       142        41
8               Creedence Clearwater Revival        76        40
9                                       Kiss        52        35
10                              Foo Fighters        84        33
11                     Red Hot Chili Peppers       127        31
12                             Lenny Kravitz       100        30
13                                  The Cult       139        30
14                                   Nirvana       110        29
15                             Guns N' Roses        88        28
16                                   Santana        59        27
17                                     Skank       130        23
18                                   The Who       144        20
19                                     AC/DC         1        18
20                             Ozzy Osbourne       114        18
21                              Jimi Hendrix        94        17
22                               Soundgarden       132        17
23                               Def Leppard        78        16
24                                 Aerosmith         3        15
25                             Faith No More        82        15
26                                   O Ter�o       111        15
27                                Audioslave         8        14
28                                    R.E.M.       124        14
29                               Raul Seixas       126        14
30                                      Rush       128        14
31                                The Police       141        14
32                         Alanis Morissette         4        13
33                           Velvet Revolver       153        13
34                           Alice In Chains         5        12
35                           David Coverdale        55        12
36                              Page & Plant       115        12
37                                 Scorpions       179        12
38                       Stone Temple Pilots       134        12
39                                 The Doors       140        11
40                                Jamiroquai        92        10
41                              Joe Satriani        95        10
42                                 Marillion       102        10
43                               Men At Work       105        10
44                              Paul D'Ianno       117        10
45           Frank Zappa & Captain Beefheart        23         9
46                                Pink Floyd       120         9
47  Terry Bozzio, Tony Levin & Steve Stevens       136         7
48                                    Accept         2         4
49                                The Posies       200         2
50                            Dread Zeppelin       157         1

- Find out which artist has earned the most according to the InvoiceLines
- Use this artist to find which customer spent the most on this artist

In [21]:
sql1 = '''SELECT DISTINCT e."ArtistId",
                e."Name",
                sum(b."UnitPrice"*"Quantity") OVER (PARTITION BY e."ArtistId") AS total_earings
FROM "Invoice" a
LEFT JOIN "InvoiceLine" b ON a."InvoiceId" = b."InvoiceId"
LEFT JOIN "Track" c ON b."TrackId" = c."TrackId"
LEFT JOIN "Album" d ON c."AlbumId" = d."AlbumId"
LEFT JOIN "Artist" e ON d."ArtistId" = e."ArtistId"
ORDER BY total_earings DESC'''
select(sql1)

     ArtistId                                          Name  total_earings
0          90                                   Iron Maiden         138.60
1         150                                            U2         105.93
2          50                                     Metallica          90.09
3          22                                  Led Zeppelin          86.13
4         149                                          Lost          81.59
..        ...                                           ...            ...
160       200                                    The Posies           0.99
161       260                Adrian Leaper & Doreen de Feis           0.99
162       264  Kent Nagano and Orchestre de l'Op�ra de Lyon           0.99
163       238                              Maurizio Pollini           0.99
164       242         Edo de Waart & San Francisco Symphony           0.99

[165 rows x 3 columns]

In [22]:
sql2 = '''SELECT DISTINCT "CustomerId",
                sum(b."UnitPrice"*"Quantity") OVER (PARTITION BY "CustomerId") AS customer_spendings
FROM "Invoice" a
         LEFT JOIN "InvoiceLine" b ON a."InvoiceId" = b."InvoiceId"
         LEFT JOIN "Track" c ON b."TrackId" = c."TrackId"
         LEFT JOIN "Album" d ON c."AlbumId" = d."AlbumId"
         LEFT JOIN "Artist" e ON d."ArtistId" = e."ArtistId"
WHERE e."Name"='Iron Maiden'
ORDER BY customer_spendings DESC'''
select(sql2)

    CustomerId  customer_spendings
0           55               17.82
1           35               15.84
2           16               13.86
3           36               13.86
4            5                8.91
5           27                8.91
6           19                5.94
7           39                5.94
8           58                5.94
9            7                4.95
10          25                4.95
11          15                3.96
12          54                3.96
13          50                2.97
14          11                1.98
15          13                1.98
16          31                1.98
17          33                1.98
18          51                1.98
19          52                1.98
20          53                1.98
21          59                1.98
22          10                0.99
23          30                0.99
24          45                0.99
25          46                0.99
26          49                0.99

- Return all the track names that have a song length longer than the average song
length.

In [23]:
sql = '''SELECT tt."Name",
       tt."Milliseconds"
FROM
    (SELECT t."Name",
            "Milliseconds",
            AVG ("Milliseconds") OVER (PARTITION BY t .col) AS average
     FROM
         (SELECT "Name",
                 1 AS col,
                 "Milliseconds"
          FROM "Track")t)tt
WHERE tt."Milliseconds">tt.average
ORDER BY "Milliseconds" DESC'''
select(sql)

                                                  Name  Milliseconds
0                               Occupation / Precipice       5286953
1                              Through a Looking Glass       5088838
2                          Greetings from Earth, Pt. 1       2960293
3                              The Man With Nine Lives       2956998
4                          Battlestar Galactica, Pt. 2       2956081
..                                                 ...           ...
489                                   22 Acacia Avenue        395572
490                                  The Unforgiven II        395520
491                                 The Shortest Straw        395389
492  Concerto for Clarinet in A Major, K. 622: II. ...        394482
493                                        Wicked Ways        393691

[494 rows x 2 columns]